In [7]:
taxi = pd.read_csv("/Users/jisuim/Desktop/tp_taxi/jisu/train.csv")

In [9]:
taxi.tail(10)

,id,vendor_id,pickup_datetime,dropoff_datetime,passenger_count,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,store_and_fwd_flag,trip_duration
1458634,id3445276,1,2016-04-03 13:51:25,2016-04-03 14:07:37,2,-73.989075,40.730465,-73.963882,40.773739,N,972
1458635,id3027038,2,2016-05-19 14:46:55,2016-05-19 14:50:52,1,-73.985390,40.763020,-73.989708,40.767502,N,237
1458636,id0405770,2,2016-02-12 10:13:06,2016-02-12 10:26:26,1,-73.863815,40.769684,-73.864395,40.761326,N,800
1458637,id1920898,1,2016-04-17 18:48:16,2016-04-17 19:00:56,1,-73.975357,40.751705,-73.949478,40.776764,N,760
1458638,id1454193,2,2016-02-02 00:39:39,2016-02-02 00:46:33,5,-73.988823,40.736553,-73.989166,40.757393,N,414
1458639,id2376096,2,2016-04-08 13:31:04,2016-04-08 13:44:02,4,-73.982201,40.745522,-73.994911,40.740170,N,778
1458640,id1049543,1,2016-01-10 07:35:15,2016-01-10 07:46:10,1,-74.000946,40.747379,-73.970184,40.796547,N,655
1458641,id2304944,2,2016-04-22 06:57:41,2016-04-22 07:10:25,1,-73.959129,40.768799,-74.004433,40.707371,N,764
1458642,id2714485,1,2016-01-05 15:56:26,2016-01-05 16:02:39,1,-73.982079,40.749062,-73.974632,40.757107,N,373
1458643,id1209952,1,2016-04-05 14:44:25,2016-04-05 14:47:43,1,-73.979538,40.781750,-73.972809,40.790585,N,198

In [2]:
len(taxi)

1458644

> id는 a unique identifier for each trip, vendor_id = 공급업체?

> datetime = meter기 on/off

> store and fwd flag = Y:저장전달

In [3]:
taxi2 = taxi.dropna(how = 'any')

In [10]:
len(taxi2)

1458644

> missing data 없음

- 출발시간대에 따라 분류(월별, 요일별, 시간대별)
- 도착시간대에 따라 분류(필요없을듯)
- 인원수(관계거의없을것지만 상관관계 체크)
- 출발지와 도착지 직선거리계산 -> 시간과의 상관관계 체크

In [4]:
taxi_test = pd.read_csv("/Users/jisuim/Desktop/tp_taxi/jisu/test.csv")

In [5]:
taxi_test.head(10)

,id,vendor_id,pickup_datetime,passenger_count,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,store_and_fwd_flag
0,id3004672,1,2016-06-30 23:59:58,1,-73.988129,40.732029,-73.990173,40.756680,N
1,id3505355,1,2016-06-30 23:59:53,1,-73.964203,40.679993,-73.959808,40.655403,N
2,id1217141,1,2016-06-30 23:59:47,1,-73.997437,40.737583,-73.986160,40.729523,N
3,id2150126,2,2016-06-30 23:59:41,1,-73.956070,40.771900,-73.986427,40.730469,N
4,id1598245,1,2016-06-30 23:59:33,1,-73.970215,40.761475,-73.961510,40.755890,N
5,id0668992,1,2016-06-30 23:59:30,1,-73.991302,40.749798,-73.980515,40.786549,N
6,id1765014,1,2016-06-30 23:59:15,1,-73.978310,40.741550,-73.952072,40.717003,N
7,id0898117,1,2016-06-30 23:59:09,2,-74.012711,40.701527,-73.986481,40.719509,N
8,id3905224,2,2016-06-30 23:58:55,2,-73.992332,40.730511,-73.875618,40.875214,N
9,id1543102,2,2016-06-30 23:58:46,1,-73.993179,40.748760,-73.979309,40.761311,N

# pickup_datetime 오름차순으로 데이터 sort

In [15]:
taxi_sort = taxi.sort_values(by=['pickup_datetime'], ascending=True).reset_index(drop=True)

In [64]:
len(taxi_sort)

1458644

In [35]:
taxi_sort.loc[1000]

id                              id2617702
vendor_id                               1
pickup_datetime       2016-01-01 01:49:25
dropoff_datetime      2016-01-01 02:04:00
passenger_count                         1
pickup_longitude                 -73.9841
pickup_latitude                   40.7376
dropoff_longitude                -73.9514
dropoff_latitude                    40.77
store_and_fwd_flag                      N
trip_duration                         875
month                                  01
Name: 1000, dtype: object

> 월별 index 추가

In [16]:
for i in range(len(taxi_sort)):
    k = taxi_sort['pickup_datetime'][i][5:7]
    taxi_sort.at[i, "month"] = k

In [24]:
taxi_month = pd.DataFrame(taxi_sort, columns=["month", "trip_duration"])

In [45]:
taxi_month.groupby('month').agg('mean').reset_index()  ### 월별 평균 trip_duration

  month  trip_duration
0    01     922.373319
1    02     920.830453
2    03     937.365363
3    04     962.891462
4    05     999.450555
5    06    1013.367226

> 시간대별 index 추가

In [63]:
for i in range(len(taxi_sort)):
    k = taxi_sort['pickup_datetime'][i][11:13]
    taxi_sort.at[i, "time"] = k

In [47]:
taxi_time = pd.DataFrame(taxi_sort, columns=["time", "trip_duration"])

In [48]:
taxi_time.groupby("time").agg("mean").reset_index() ### 시간대별 평균 trip_duration

   time  trip_duration
0    00     936.657302
1    01     903.087112
2    02     890.076934
3    03     890.070878
4    04     921.976444
5    05     822.298960
6    06     797.434943
7    07     831.758345
8    08     924.559199
9    09     933.528915
10   10     933.367605
11   11     966.430282
12   12     993.533079
13   13    1032.246359
14   14    1075.789264
15   15    1118.832533
16   16    1080.146285
17   17    1030.581619
18   18     981.583234
19   19     894.356679
20   20     879.461545
21   21     890.521221
22   22    1023.455921
23   23     925.091409

> 요일별 index 추가

In [67]:
import calendar
for i in range(len(taxi_sort)):
    m = taxi_sort['pickup_datetime'][i][5:7]
    d = taxi_sort['pickup_datetime'][i][8:10]
    k = calendar.weekday(2016, int(m), int(d))
    taxi_sort.at[i, "weekday"] = k

In [68]:
taxi_weekday = pd.DataFrame(taxi_sort, columns=['weekday','trip_duration'])

In [69]:
taxi_weekday.groupby('weekday').agg('mean').reset_index() ### 요일별 평균 trip_duration (0~6 : Mon~Sun)

   weekday  trip_duration
0      0.0     897.947839
1      1.0     983.463124
2      2.0     975.450494
3      3.0    1006.528654
4      4.0     990.224200
5      5.0     948.051175
6      6.0     901.639395

> store and flag로 나누기

In [8]:
taxi_snf = pd.DataFrame(taxi, columns=['store_and_fwd_flag', 'trip_duration'])

In [9]:
taxi_snf.groupby('store_and_fwd_flag').agg('mean').reset_index()

  store_and_fwd_flag  trip_duration
0                  N     958.819706
1                  Y    1080.763331

> passenger 수별로 나누기

In [10]:
taxi_passenger = pd.DataFrame(taxi, columns=['passenger_count', 'trip_duration'])

In [11]:
taxi_passenger.groupby('passenger_count').agg('mean').reset_index()

   passenger_count  trip_duration
0                0    1718.433333
1                1     930.399753
2                2    1005.458335
3                3    1028.236276
4                4    1053.529749
5                5    1070.232174
6                6    1061.355223
7                7      19.666667
8                8     104.000000
9                9     560.000000